In [1]:
import pandas as pd
import numpy as np

# Using apply() and groupby() to create your own groups

Here we will show a simple use of apply() method and groupby() method that can be very useful. Note, that this *far more simple* use of the apply() method than the one shown in the advanced topics in Lecture 18 notebook. 

Let us say you want to group the 'AIRLINE' but not necessarily the same airline but according to the their alliance. How can you achieve this? THe following are the groups of airlines that are in each of the alliances

Star Alliance:
* UA - United Airlines
* OO - Skywest Airlines

Oneworld Alliance:
* AA - American Airlines
* US - US Airlines
* MQ - American Eagle Airlines Inc. 

SkyTeam Alliance:
* DL - Delta Airlines
* EV - Atlantic Sotheast Airlines
* VX - Virgin America

NoAlliance; Not in any alliance:

* F9 - Forntier
* B6 - Jetblue
* NK - Spirit
* WN - Southwest
* HA - Hawaiian
* AS - Alaskan

In [2]:
flights = pd.read_csv('./data/flight_sample.csv')
flights.head()

,YEAR,MONTH,DAY,DAY_OF_WEEK,AIRLINE,FLIGHT_NUMBER,TAXI_IN,TAXI_OUT,DISTANCE
0,2015,8,19,3,EV,3260,7.0,20.0,1091
1,2015,9,23,3,WN,3050,4.0,9.0,837
2,2015,10,16,5,AA,1382,13.0,25.0,761
3,2015,1,19,1,WN,4274,5.0,23.0,1547
4,2015,4,22,3,WN,2237,5.0,18.0,872

In [3]:
def get_alliance(airline):
    if airline in ['UA','OO']:
        return 'Star'
    elif airline in ['AA', 'US', 'MQ']:
        return 'Oneworld'
    elif airline in ['DL','EV', 'VX']:
        return 'SkyTeam'
    elif airline in ['AS', 'F9', 'B6', 'NK', 'WN', 'HA']:
        return 'NoAlliance'

In [5]:
# Test the function
get_alliance('AA')

'Oneworld'

In [6]:
# CREATING a new column called 'Alliance' and assigning the alliance based on the function
flights['Alliance'] = flights['AIRLINE'].apply(get_alliance)

In [7]:
flights.sample(5)

,YEAR,MONTH,DAY,DAY_OF_WEEK,AIRLINE,FLIGHT_NUMBER,TAXI_IN,TAXI_OUT,DISTANCE,Alliance
5355,2015,11,19,4,DL,1691,6.0,18.0,311,SkyTeam
5404,2015,5,18,1,WN,538,3.0,10.0,323,NoAlliance
8652,2015,2,4,3,EV,5372,4.0,4.0,241,SkyTeam
7267,2015,8,31,1,WN,2364,11.0,8.0,248,NoAlliance
8007,2015,9,9,3,DL,1944,4.0,14.0,297,SkyTeam

In [8]:
flights_by_alliance = flights.groupby(['Alliance'])

In [9]:
type(flights_by_alliance)

pandas.core.groupby.generic.DataFrameGroupBy

In [10]:
df_means = flights_by_alliance['DISTANCE','TAXI_IN'].mean()

In [11]:
df_means

              DISTANCE   TAXI_IN
Alliance
NoAlliance  843.074474  6.593195
Oneworld    882.712241  8.769113
SkyTeam     734.778623  7.450596
Star        854.930765  7.617179

In [ ]:
type(df_means)

In [12]:
df_means.loc['Star']['DISTANCE']

854.9307652264446

### Detour:  `sort_values()`, a method to sort rows based on a column

In [13]:
df_means

              DISTANCE   TAXI_IN
Alliance
NoAlliance  843.074474  6.593195
Oneworld    882.712241  8.769113
SkyTeam     734.778623  7.450596
Star        854.930765  7.617179

In [14]:
df_means.sort_values(['DISTANCE'], inplace=True, ascending=False)
df_means

              DISTANCE   TAXI_IN
Alliance
Oneworld    882.712241  8.769113
Star        854.930765  7.617179
NoAlliance  843.074474  6.593195
SkyTeam     734.778623  7.450596

### Activity:

1. Drop all rows in `college_scorecard_small` that has any missing values

2. Add another column `sat_avg_level` to the `college_scorecard_small` DataFrame. It is assigned the following values based on the values in `sat_average`. **You need to write a function and use ``apply()`` method**
   * Lower_sat
       - sat_average <= 973 
   * Below_avg_sat
       - 973 < sat_average <= 1039
   * Abv_avg_sat
       - 1039 < sat_average <= 1120
   * Higher_sat
       - sat_average> 1120
   
3. Is there a relationship between `sat_avg_level` and `pell_grant_receipents`? How about relationship with `full_time_retention_rate_4_year`? 
   * Group by sat_avg_level and find the average for the rest of the two columns and make your interpretation.

In [15]:
college_scorecard = pd.read_csv(
    './data/college-scorecard-data-scrubbed.csv', 
    encoding='latin-1')

# I'm extracting only three columns and creating a copy for this analysis. 
college_scorecard_small = college_scorecard[['sat_average', 'pell_grant_receipents','full_time_retention_rate_4_year']].copy()
college_scorecard_small.head()

   sat_average  pell_grant_receipents  full_time_retention_rate_4_year
0          NaN                 0.3571                           0.3333
1          NaN                 0.7078                              NaN
2          NaN                 0.8868                              NaN
3       1054.0                 0.3152                           0.7742
4          NaN                 0.0737                              NaN

In [18]:
# drop any data with missing data and make sure it stays that way
print(college_scorecard_small.shape)
college_scorecard_small.dropna(inplace=True)
print(college_scorecard_small.shape)

(7282, 3)
(1268, 3)

In [29]:
# create a function to categorize the sat_average values
def determine_sat_level(avg):

    if avg <= 973:
        return "Low"
    elif 973 < avg <= 1039:
        return "Below Average"
    elif 1039 < avg <= 1120:
        return "Above Average"
    elif avg> 1120:
        return "High"
    else:
        "Inconcievable!"

In [32]:
# test function
print(determine_sat_level(670))
print(determine_sat_level(1357))
print(determine_sat_level(999))

Low
High
Below Average

In [33]:
# add a sat_avg_level column using the function above
college_scorecard_small['sat_avg_level'] = college_scorecard_small['sat_average'].apply(determine_sat_level)
college_scorecard_small.head()

,sat_average,pell_grant_receipents,full_time_retention_rate_4_year,sat_avg_level
3,1054.0,0.3152,0.7742,Above Average
10,827.0,0.7356,0.6595,Low
14,851.0,0.7347,0.5725,Low
17,1215.0,0.1610,0.9052,High
18,1009.0,0.4192,0.6520,Below Average

In [39]:
# group by our new column

scorecard_by_sat_avg = college_scorecard_small.groupby('sat_avg_level')
summary_sat_cat = scorecard_by_sat_avg['pell_grant_receipents','full_time_retention_rate_4_year'].mean()
# get the averages of 'pell_grant_receipents','full_time_retention_rate_4_year'
# display the reuslts
summary_sat_cat
# how would you get the 
# * min and max of the sat averages 
# * meidan pell grant recipients 
# summary_sat_cat['pell_grant_receipents'].median()
# * average retention rate?

               pell_grant_receipents  full_time_retention_rate_4_year
sat_avg_level
Above Average               0.342678                         0.776322
Below Average               0.402556                         0.716375
High                        0.236075                         0.882165
Low                         0.491596                         0.671799

# Pivot Tables: Two-dimensional GroupBy

We have seen how the ``GroupBy`` abstraction lets us explore relationships within a dataset.
A *pivot table* is a similar operation that is commonly seen in spreadsheets and other programs that operate on tabular data.
The pivot table takes simple column-wise data as input, and groups the entries into a two-dimensional table that provides a multidimensional summarization of the data.

In [40]:
flights.head()

,YEAR,MONTH,DAY,DAY_OF_WEEK,AIRLINE,FLIGHT_NUMBER,TAXI_IN,TAXI_OUT,DISTANCE,Alliance
0,2015,8,19,3,EV,3260,7.0,20.0,1091,SkyTeam
1,2015,9,23,3,WN,3050,4.0,9.0,837,NoAlliance
2,2015,10,16,5,AA,1382,13.0,25.0,761,Oneworld
3,2015,1,19,1,WN,4274,5.0,23.0,1547,NoAlliance
4,2015,4,22,3,WN,2237,5.0,18.0,872,NoAlliance

In [41]:
# index is the row grouping and columns is the column grouping, 
# the first parameter is the one that is aggregated

flight_pvt = flights.pivot_table(
        'DISTANCE',
        index='DAY_OF_WEEK', 
        columns = 'Alliance'
        )

flight_pvt

Alliance     NoAlliance    Oneworld     SkyTeam        Star
DAY_OF_WEEK
1            839.861856  841.852113  785.222772  871.846154
2            857.928155  817.296167  696.713178  809.895911
3            811.619145  894.945848  765.838791  852.893993
4            823.606238  874.069079  727.983491  816.889262
5            861.238281  922.049853  701.717391  881.644195
6            853.011765  941.658537  723.755853  880.654762
7            855.118012  888.644599  735.820000  875.887218

### Modifying the default behavior with `aggfunc` keyword argument

In [42]:
flight_pvt = flights.pivot_table('DISTANCE',index='DAY_OF_WEEK', 
                                 columns = 'Alliance', 
                                 aggfunc = np.sum)
flight_pvt

Alliance     NoAlliance  Oneworld  SkyTeam    Star
DAY_OF_WEEK
1                407333    239086   317230  249348
2                441833    234564   269628  217862
3                398505    247900   304038  241369
4                422510    265717   308665  243433
5                440954    314419   258232  235399
6                362530    231648   216403  221925
7                413022    255041   257537  232986

### You can get the totals using `margins` keyword argument

In [43]:
flight_pvt = flights.pivot_table('DISTANCE',index='DAY_OF_WEEK', 
                                 columns = 'Alliance', 
                                 aggfunc = np.sum, 
                                 margins=True)
flight_pvt

Alliance     NoAlliance  Oneworld  SkyTeam     Star      All
DAY_OF_WEEK
1                407333    239086   317230   249348  1212997
2                441833    234564   269628   217862  1163887
3                398505    247900   304038   241369  1191812
4                422510    265717   308665   243433  1240325
5                440954    314419   258232   235399  1249004
6                362530    231648   216403   221925  1032506
7                413022    255041   257537   232986  1158586
All             2886687   1788375  1931733  1642322  8249117

In [44]:
# get second day of the week for 'No Alliance'
flight_pvt.loc[2]['NoAlliance']

441833

In [45]:
flights.groupby(['DAY_OF_WEEK','Alliance'])[['DISTANCE']].sum()

                        DISTANCE
DAY_OF_WEEK Alliance
1           NoAlliance    407333
            Oneworld      239086
            SkyTeam       317230
            Star          249348
2           NoAlliance    441833
            Oneworld      234564
            SkyTeam       269628
            Star          217862
3           NoAlliance    398505
            Oneworld      247900
            SkyTeam       304038
            Star          241369
4           NoAlliance    422510
            Oneworld      265717
            SkyTeam       308665
            Star          243433
5           NoAlliance    440954
            Oneworld      314419
            SkyTeam       258232
            Star          235399
6           NoAlliance    362530
            Oneworld      231648
            SkyTeam       216403
            Star          221925
7           NoAlliance    413022
            Oneworld      255041
            SkyTeam       257537
            Star          232986

## Activity: Birthrate Data

As a more interesting example, let's take a look at the freely available data on births in the United States, provided by the Centers for Disease Control (CDC).
This data can be found at https://raw.githubusercontent.com/jakevdp/data-CDCbirths/master/births.csv
(this dataset has been analyzed rather extensively by Andrew Gelman and his group; see, for example, [this blog post](http://andrewgelman.com/2012/06/14/cool-ass-signal-processing-using-gaussian-processes/)):

1. Create a column called `decade` in the births_df dataframe loaded below. 
    * Use the column called `year` to create the `decade`. For example, if you were born in 1969 it should say your decade is 1960
2. Create a pivot table that counts number of `births` in each decade and also based on whether they were male or female

In [ ]:
births_df = pd.read_csv('./data/births.csv')

In [ ]:
births_df.sample(4)

In [ ]:
(1969//10)*10

In [ ]:
# add a 'decade' column and use the formula (births_df['year'] // 10 ) * 10

In [ ]:
# Create a pivot table that counts number of births in each decade and also based on whether they were male or female

<div class="alert alert-block alert-danger">
<h3> CAUTION AHEAD </h3>
<p> </p>
<p> The topics discussed ahead are advanced and you need to absolutely make sure you understand everything discussed in the previous classes to move forward.</p>
</div>

### Advanced Topics: filter() and transform()

These functions give a lot more flexibility on `DataFrameGroupBY` objects and they are discussed below. They are advanced topics, however, I **strongly encourage** you to read through them and you could use them for finding very interesting patterns in the data.

In [ ]:
# Starter code for the Advanced Topics, you will need to run this before you use them further. 
college_loan_defaults = pd.read_csv(
    './data/college-loan-default-rates.csv')

college_scorecard = pd.read_csv(
    './data/college-scorecard-data-scrubbed.csv', 
    encoding='latin-1')

#### The `filter()` Method

You can use the `filter()` method to generate a new dataframe after filtering out groups that don't pass a given criteria. It allows you to answer questions like this: *what states in college scorecard have rows where the average SAT score (for the state) is above 1100?*

To use this method, you must pass in a function that takes a single parameter, which is the group to evaluate. The function must return either `True`/`False` depending on whether or not the *rows of the group* should be kept or discarded in the new dataframe.

So, with this in mind, let's define a `sat_filter` function so that groups with average SAT scores of less than 1100 are dropped from consideration.

In [ ]:
colleges_by_state = college_scorecard.groupby(['state'])

In [ ]:
def size_filter(group):
    if group['sat_average'].mean() >= 1150:
        return True
    else:
        return False

And now let's use it on to see which rows remain in the new dataframe after applying the filter:

In [ ]:
college_scorecard[['state','city', 'sat_average']].sample(10)

In [ ]:
# this doesn't work because it's not grouped
# college_scorecard[['state','city', 'sat_average']].filter(size_filter)

In [ ]:
# Just to reduce the complexity here, I'm only going
# to display the `sat_average`, `state`, and `city` fields 
filter_results = colleges_by_state[['institution_name','state','city', 'sat_average']].filter(size_filter)
filter_results

There are a couple of ***really*** important things to notice here:
1. Unlike the **`aggregate`** method, the data returned here is not grouped by state as you probably expected it to be. The filter is used on a grouped dataframe, but it returns a new "normal" dataframe.
2. Notice that we have a bunch of rows for Washington DC and Rhode Island, but nothing else. If we've done things correctly, this would mean that the colleges in those two states have average SAT scores of at least 1150.

#### The `transform()` Method

You use the **`transform()`** method to generate a new dataframe that modifies/transforms the values of the grouped dataframes columns.

That probably just confused the heck out of you. So we will start with a practical example.

Let's say that we wanted to center the data for the *`year_1_default_rate`* and *`year_2_default_rate`* columns of our **`college_loan_defaults_by_state`** grouped dataframe. 

Let's step through how we could do that with **`transform()`**.

Just like with the **`filter()`** method, we have to create a function that we will pass to the **`transform`** method, but this time the function will evaluate each series (column) of each group, rather than the groups as a whole.

In [ ]:
# Just extracting three columns for this analysis
college_loan_defaults_subset = college_loan_defaults[['name', 'state', 'year_1_default_rate']]
college_loan_defaults_subset.head()

In [ ]:
college_loan_defaults_by_state = college_loan_defaults_subset.groupby('state')

In [ ]:
#the mean for each state
college_loan_defaults_by_state['year_1_default_rate'].mean()[:5]

In [ ]:
# This function will be called on each 
# series of each group in your DataFrameGroupBy object
def center_default_rate(series):
    return series - series.mean()

In [ ]:
# We'll also use the rename() method to apply some friendly column names.
transformed_default_rates = college_loan_defaults_by_state.transform(
    center_default_rate).rename(
        columns={'year_1_default_rate': 'centered_year_1_default_rate'})

transformed_default_rates.head()

<div class="alert alert-block alert-info">
<p>
Our `college_loan_defaults_by_state` dataframe included four columns: name, state, and year_1_default_rate.
</p> 
<p>But here in the returned dataframe we only have `centered_year_1_default_rate`. The reason for this is that the other two columns were strings, and you can't calculate the mean of a series of strings.
</p>
<p>
Because of this, Pandas just silently drops them from the new dataframe that is returned from the `tranform` method.
</p>
</div>

So now we have our centered rates in a new dataframe. Let's merge together the result of our **`transform`** method and our *`college_loan_defaults_subset`* dataframe.

In [ ]:
# Make sure to specify the indices as the "join column" or Pandas
# will try to join the dataframes based on the shared 'year_1_default_rate' column.
pd.merge(college_loan_defaults_subset, transformed_default_rates, 
         left_index=True, 
         right_index=True)[:5]